{"cursor":"1970","size":15,"audio":[],"currentlang":"en","article":"\n\nIn object-oriented programming an 'instance' is an occurrence or a copy of an\nobject, whether currently executing or not. Instances of a class share the same\nset of attributes, yet will typically differ in what those attributes contain.\nFor example, a class \"Employee\" would describe the attributes common to all\ninstances of the Employee class. For the purposes of the task being solved\nEmployee objects may be generally alike, but vary in such attributes as \"name\"\nand \"salary\". The description of the class would itemize such attributes and\ndefine the operations or actions relevant for the class, such as \"increase\nsalary\" or \"change telephone number.\" One could then talk about one instance of\nthe Employee object with name = \"Jane Doe\" and another instance of the Employee\nobject with name = \"John Doe\".\n\nClass (computer programming): In object-oriented programming, a class is a\nconstruct that is used as a blueprint to create instances of itself – referred\nto as class instances, class objects, instance objects or simply objects. A\nclass defines constituent members which enable these class instances to have\nstate and behavior. Data field members (member variables or instance variables)\nenable a class object to maintain state. Other kinds of members, especially\nmethods, enable a class object's behavior. Class instances are of the type of\nthe associated class.\n\nA class usually represents a noun, such as a person, place or (possibly quite\nabstract) thing, or something nominalized. For example, all fruits, bananas,\napples and such would be instances of the class \"Fruit\" (a \"Fruit\" object). It\nis of the type \"Fruit\". This should not be confused with \"sub-types of\".\n\"Bananas\" are a sub-type of \"Fruit\", but the class of \"Bananas\" itself would not\nbe an instance of \"Fruit\".\n","linknr":93,"url":"Instance_(computer_science)","recorded":1362543440,"links":19,"instances":["computer_science","computer_programming"],"pdf":[],"categories":["Object (computer science)"],"headings":[],"image":["//upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png","//upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Ambox_wikify.svg/40px-Ambox_wikify.svg.png","//bits.wikimedia.org/static-1.21wmf10/skins/vector/images/search-ltr.png?303-4","//bits.wikimedia.org/images/wikimedia-button.png","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/poweredby_mediawiki_88x31.png"],"tags":[["object","computer_science"],["class","computer_programming"]],"members":["object","class"],"related":["Object-oriented_programming","Object_(computer_science)","Class_(computer_programming)"]}