{"cursor":"3852","size":15,"audio":[],"currentlang":"en","article":"Java In the Java programming language, transient is a keyword used\nas a field modifier. When a field is declared transient, it would not be\nserialized even if the class to which it belongs is serialized. In Java,\nmethods, classes and interfaces cannot be declared as transient. [http://ja-\nva.sun.com/developer/technicalArticles/Programming/serialization/ Discover the\nsecrets of the Java Serialization API] - article from Sun\n\nIn Hibernate and other persistance systems, 'transient' describes an object that\nhas been instantiated, but is not associated with a Hibernate session,\ni. e. the object resides in memory but is not being persisted. For more\ndetail go to:\n[http://docs.jboss.org/hibernate/orm/3.3/reference/en/html/objectstate.html\nJboss.org]\n\nX\n\nIn the X Window System, a window is said to be 'transient' for another window if\nit belongs to that other window and may not outlast it: a dialog box, such as an\nalert message, is a common example. This should not be confused with a window\ncontaining another window: contained windows lie entirely within their parents,\nbut transients are separate windows which can generally be moved freely around\nthe screen. Transient windows may be treated specially by the window manager,\nand unlike top-level windows (which can require user placement, as in twm), must\nnever require any user interaction on appearing. http://tronche.com/gui/x/icccm/sec-\n4.html\n\nOperating Systems\n\n\n'Transient' also refers to a module that, once loaded into main memory, is\nexpected to remain in memory for a short time. Today, the term is rarely used,\nand may be obsolete. The term Overlay is commonly used instead, and refer to a\nprogram module that is brought to memory when it is needed by the running\nprogram and then replaced with another when it is no longer needed, so a\nprogram had lower memory requirements. Program modules were written to allow\ndifferent modules to share the same memory region and the main program itself\nwas responsible of exchanging modules between disk and memory as\nnecessary. William Stallings, Sistemas Operativos, 5th edition (2005),\nPage 311\n\nIn the mid-to-late 1960s, mainframe computers, such as the IBM System/360, had\nmemory sizes from 8 KB to 512 KB. In order to conserve memory, transients were\nsmall modules that supported a specific task, and were swapped in and out of\nmemory. The operating system for the 360 had two areas reserved for transients\nthat supported input/output operations. These were referred to as the âlogical\ntransient area,â and the âphysical transient area.â If an application program,\nfor example, needed to use the printer, transients that supported printing\nwere brought into the transient areas. If an application needed to use tape\ndrives, transients that supported tape drive access were brought into the\ntransient areas.\n\nMessage Passing At the level of message passing, transient communication means\nthe way by which the messages are not saved into a buffer to wait for its\ndeliver at the message receiver. The messages will be delivered 'only' if both\nthe systems (sender and receiver) are running. If the receiver is not running at\nthe send time, the message will be discarded, because it has not been stored\ninto intermediate buffers.\n\nReferences\n","linknr":118,"url":"Transient_(computer_programming)","recorded":1362562716,"links":15,"instances":["java","programming_language","programming"],"pdf":[],"categories":["Computer programming","X Window System"],"headings":["Java","X","Operating Systems","Message Passing","References"],"image":["//upload.wikimedia.org/wikipedia/commons/thumb/8/86/Dialog1.png/220px-Dialog1.png","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/magnify-clip.png","//upload.wikimedia.org/wikipedia/en/f/f4/Ambox_content.png","//upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png","//bits.wikimedia.org/static-1.21wmf10/skins/vector/images/search-ltr.png?303-4","//bits.wikimedia.org/images/wikimedia-button.png","//bits.wikimedia.org/static-1.21wmf10/skins/common/images/poweredby_mediawiki_88x31.png"],"tags":[["java","programming_language"],["hibernate","java"],["overlay","programming"]],"members":["hibernate","java","overlay"],"related":["Java_(programming_language)","Java_keywords","Serialization","Hibernate_(Java)","X_Window_System","Window_manager","Twm","Computer_storage","Overlay_(programming)","IBM_System/360","Kilobyte","Message_passing"]}